B1-K2-W2 samenvatting van Ervin
1 Visio gereedmaken video
Op het examen ga je werken met Visio. In Visio ga je een netwerk tekening maken. Ik heb hieronder een voorbeeld van een netwerk tekening in Visio.









Shapes toevoegen en je netwerk bouwen in Visio
Hieronder zie je een screenshot over de shapes.
Deze shapes kan je mooi gebruiken voor je netwerk tekening. Ik denk zelf dat we de 3015 shapes niet hoeven te downloaden. Het zit dan namelijk al in Visio.










Shapes kan je slepen met je muis om in de lege tekening te zetten







Tekst toevoegen
Als je een tekst wilt invoegen ga je eerst naar invoegen en dan klik je op Bijschrift. Vervolgens zie je allemaal bijschriften staan. Selecteer een van deze bijschriften om een tekst toe te voegen aan de netwerk tekening. 















IP tabel vullen deel 1 video
Hieronder staat een IP tabel. 
Met het examen B1-K2-W2 gaan we te maken hebben met deze tabel. Je moet de gele vakken invullen. Groene vakken zijn al ingevuld. 











Je ziet hieronder de Packet tracer staan van 10.2.6. In deze samenvatting gaan we veel werken met Packet tracer.










Admin PC/cmd (command prompt)
We beginnen eerst met de Admin PC. 
Vanaf de Admin PC kunnen we zien via de cmd welke IP adressen komen. Vervolgens kunnen we de IP tabel helemaal invullen.
Commandoâ€™s in cmd Admin PC:
Rood is de commando wat je moet invoeren in de cmd!
C:\> ssh -l admin01 192.168.1.1
Password: S3cre7P@55
Edge#
Edge# sh ip interface brief
Edge# show run deze commando laat alle netwerken zien. Zoals IP adres en subnetmask etc. 
Tip: Gebruik deze commando tijdens je examen dan kan je zien welke netwerken verbonden zijn etc.
Als je de show run commando doet zie je alle netwerken informatie.













Hieronder hebben we de IP tabel en de cmd staan. Als je goed kijkt hebben we de 209.165.200.5 IP adres in de cmd. De subnet mask staat er ook bij: 255.255.255.252. Vul deze subnet mask in de IP tabel.


Edge# show lldp neigbors
% LLDP is not enabled. Dit betekent dat de lldp niet ingeschakeld is.
We gaan ervoor zorgen dat het wel ingeschakeld word
Edge#config t
Edge(config)#lldp run
Edge(config)#exit
Edge#show lldp neighbors
Nu zie je wel dat de lldp is ingeschakeld is.




Edge#sh ip route connected
Hier laten ze zien dat IP adressen connected zijn.
 
Edge#ping 209.165.200.7





Let op! Met deze ping zie je geen 209.165.200.7 maar 209.165.200.6.
Uiteindelijk moet er 209.165.200.10 staan onder IP Adress!
Vul dit onder de vak IP Adress in!




We gaan nu verder met een ander router.	
Edge#ssh -l RBOadmin  209.165.200.6
Let op! Er wordt nu een connectie gemaakt met de IP adres 209.165.200.10 inplaats van 209.165.200.6!

Password: S3cre7P@55
RBO-Edge#sh ip int brief
Deze commando Laat IP adressen zien of ze Up of down zijn!



RBO-Edge#show run
Vul de vakken in met deze gegevens onder Interface, IP Address en Subnet mask voor de IP tabel!
Interface, IP Address en Subnet mask:
 
IP tabel met juiste gegevens voor de interface, IP Address en Subnet mask










Doe nu exact hetzelfde hoe je het gedaan hebt met de Edge router
RBO-Edge# show lldp neighbors
% LLDP is not enabled
RBO-Edge#conf t
RBO-Edge(config)#lldp run
RBO-Edge(config)#exit
RBO-Edge#show lldp neighbors
 
Als je ziet zijn de volgende gele vakken ingevuld: RBO-Firewall en de Local interface and Connected Neighbor bij RBO-Edge
Let op! Op het examen moet je dit bij de RBO Edge zetten en niet bij de RBO-Firewall!
 
Nu gaan we kijken wat de volgende device is met deze commando.
RBO-Edge#sh ip route connected
Met de 192.168.248/30 adres wordt het 192.168.3.250. Met deze adres gaan we pingen. 
 

	
Ping is goed gegaan. Gebruik nu deze adres 192.168.3.250 om verbinding te maken met de RBO-Firewall device.
 
RBO-Edge#ssh -l RBOadmin 192.168.3.250
Password:  S3cre7P@55
Je zit nu in de RBO-Firewall device.
RBO-Firewall#
Vervolgens doe je deze commando om achter te halen welke Interface, IP en subnetmask.
RBO-Firewall#show run
Vul deze Interface, IP en subnetmask in de tabel IP.
 
Interface, IP en subnetmask zijn in gevuld in de IP tabel.










RBO-Firewall#sh lldp neighbors met deze volgende commando kan je zien welke device en local, neighbor moeten invullen in de IP tabel.

De device en local neigbor zijn ingevuld.









We gaan nu verder met de device sw-rbol.
RBO-Firewall#ping 192.168.4.255
Pak de IP adres van 192.168.4.131








We gaan nu inloggen op de sw-rbol device.
RBO-Firewall#ssh -l RBOadmin 192.168.4.131
Password: S3cre7P@55
sw-rbo1>en
Password: S3cre7P@55
sw-rbo1#show run
sw-rbo1#sh ip int brief
Deze Fast, Gig ethernet en Vlan1 moet je in de Ip tabel zetten.

Fast, Gig ethernet en Vlan1 staan in de IP tabel in.









sw-rbo1#sh lldp neighbors
Vul deze devices en de local en neighbor in de IP tabel.




De devices en de local en neighbor staan in de IP tabel.









Als je zeker wilt weten over de subnetmask van de sw-rbol doe de commando show run
Dan krijg je het subnetmask te zien.
We zijn nu klaar met de sw-rbol device. 
We gaan nu verder met de sw-rbo2 device
sw-rbo1#exit
RBO-Firewall#ssh -l RBOadmin 192.168.4.132
Password: S3cre7P@55
sw-rbo2>en
Password: S3cre7P@55
sw-rbo2#sh ip int brief
Vul deze interfaces en IP adres in de IP tabel.

Interfaces en IP adres staan in de IP tabel.








Doe nu het volgende.
sw-rbo2#sh lldp neighbors
Vul de local interface in de IP tabel.




De local interface staat in de IP tabel








We zijn klaar nu met de sw-bo2  device. 
We gaan nu verder met de sw-rbo3 device.
sw-rbo2>exit
RBO-Firewall#ssh -l RBOadmin 192.168.4.133
Password: S3cre7P@55
sw-rbo3>en
Password: S3cre7P@55
sw-rbo3#conf t
sw-rbo3(config)#lldp run
sw-rbo3(config)#exit
sw-rbo3#sh lldp neighbors
Vul de device en interfaces in de IP tabel.





de device en local, interfaces staan in de IP tabel.
 








